Проверь ещё раз корректность и пришли полный код файлов, пожалуйста (целиком, для копирования). выдержа из СП 0.13330.2016 с https://meganorm.ru/Data2/1/4293747/4293747667.htm: "" 10 Снеговые нагрузки
10.1 Нормативное значение снеговой нагрузки на горизонтальную проекцию покрытия следует определять по формуле                                      (10.1)
где с - коэффициент, учитывающий снос снега с покрытий зданий под действием ветра или иных факторов, принимаемый в соответствии с 10.5-10.9;
c - термический коэффициент, принимаемый в соответствии с 10.10;
- коэффициент формы, учитывающий переход от веса снегового покрова земли к снеговой нагрузке на покрытие, принимаемый в соответствии с 10.4;
S - нормативное значение веса снегового покрова на 1 м горизонтальной поверхности земли, принимаемое в соответствии с 10.2.
10.2 Нормативное значение веса снегового покрова на 1 м горизонтальной поверхности земли для отдельных населенных пунктов Российской Федерации принимают в соответствии с приложением К.
Для остальной территории Российской Федерации нормативное значение веса снегового покрова на 1 м горизонтальной поверхности земли следует принимать в зависимости от снегового района по данным таблицы 10.1.
Значения , указанные в таблице 10.1, допускается уточнять в установленном порядке на основе данных организаций по гидрометеорологии для места строительства. В этом случае значение  следует вычислять по формуле ,  где  - превышаемый в среднем один раз в 50 лет ежегодный максимум веса снегового покрова, определяемый на основе данных многолетних маршрутных снегосъемок о запасах воды в снеговом покрове на защищенных от прямого воздействия ветра участках местности.
Нормативное значение веса снегового покрова необходимо определять по формуле, приведенной в примечании 1 к карте 1 приложения Е, с учетом высотного коэффициента, принимаемого по таблице Е.1, или устанавливать на основе данных организаций по гидрометеорологии в следующих случаях:
- для пунктов, расположенных в горных и малоизученных районах, обозначенных на карте 1 приложения Е;
- в местах со сложным изменением рельефа и высотой над уровнем моря более 500 м.
10.3 В расчетах необходимо рассматривать схемы равномерно распределенных и неравномерно распределенных снеговых нагрузок на покрытия в их наиболее неблагоприятных расчетных сочетаниях.
10.4 Схемы распределения снеговой нагрузки и значения коэффициента формы для покрытий следует принимать в соответствии с приложением Б.
Для зданий и сооружений, имеющих габаритные размеры покрытия, превышающие 100 м в обоих направлениях, за исключением покрытий, указанных на схемах Б.1 и Б.5 приложения Б, а также во всех случаях, не предусмотренных приложением Б (при иных формах покрытий, при необходимости учета различных направлений переноса снега по покрытию, близко расположенных зданий и сооружений окружающей застройки и т.п.), схемы распределения снеговой нагрузки по покрытиям и значения коэффициента устанавливаются в рекомендациях, разработанных на основе результатов модельных испытаний в аэродинамических трубах (см. приложения Ж и И) с учетом 4.7 или имеющихся данных.
Значения коэффициента формы необходимо устанавливать с учетом наиболее неблагоприятных направлений снегопереноса, средней температуры воздуха в зимний период, влажности, закономерностей изменения плотности и структуры снегоотложений во времени для места строительства.
В тех случаях, когда более неблагоприятные условия работы элементов конструкций возникают при частичном загружении покрытия, следует рассматривать схемы со снеговой нагрузкой, действующей на половине или четверти его площади (для покрытий с фонарями - на участках шириной b).
Примечания
1 В необходимых случаях снеговые нагрузки следует определять с учетом предусмотренного дальнейшего расширения здания.
2 В приложении Б следует учитывать нормативное значение снеговой нагрузки S=S.
3 При расчетах конструкций допускается применение упрощенных схем снеговых нагрузок, эквивалентных по воздействию схемам нагрузок, приведенным в приложении Б.
4 При расчете прогонов покрытий следует учесть локальную неравномерность снегоотложений введением дополнительного коэффициента =1,1 к нормативным значениям снеговой равномерно распределенной нагрузки.
10.5 Коэффициент с, учитывающий снос снега с покрытий зданий под действием ветра или иных факторов, устанавливается в зависимости от типа местности (см. 11.1.6), формы покрытия и степени его защищенности от прямого воздействия ветра согласно 10.6-10.9.
10.6 Для покрытий зданий, защищенных от прямого воздействия ветра, в том числе: соседними более высокими зданиями, удаленными менее чем на 10h, где h - разность высот соседнего и проектируемого зданий; сплошными элементами конструкций, возвышающимися над покрытием с двух и более сторон; более высоким лесным массивом; для покрытий, расположенных ниже окружающей местности, проектируемых на местности типа С (см. 11.1.6), а также во всех случаях, не предусмотренных в 10.7 и 10.8, следует принимать c=1,0.
10.7 Для пологих (с уклонами до 12% или 0,05) покрытий однопролетных и многопролетных зданий, проектируемых на местности типов А или В и имеющих характерный размер в плане не более 100 м (см. схемы Б.1, Б.2, Б.5 и Б.6 приложения Б), а также для покрытий высотных зданий допускается учитывать коэффициент сноса снега, принимаемый по формуле (10.2), но не менее 0,5:,                                        (10.2)
где - принимается по таблице 11.2 для типов местности A или B (см. 11.1.6);
- характерный размер покрытия, принимаемый не более 100 м;
- наименьший размер покрытия в плане;
- наибольший размер покрытия в плане.
Для покрытий с уклонами от 12 до 20% однопролетных и многопролетных зданий без фонарей, проектируемых на местности типов A или B (см. схемы Б.1 и Б.5 приложения Б) =0,85.

10.8 Для купольных сферических и конических покрытий зданий на круглом плане, регламентируемых схемами Б.13, Б.14 приложения Б, при задании равномерно распределенной снеговой нагрузки значения коэффициента с следует устанавливать в зависимости от диаметра d основания купола:
с=0,85 при d60 м;     
c=1,0 при d>100 м;                                    (10.3)     
c=0,85+0,00375(d-60) - в промежуточных случаях.
10.9 Снижение снеговой нагрузки, предусматриваемое 10.7, 10.8, не распространяется:

а) на покрытия зданий в районах со среднемесячной температурой воздуха в январе выше минус 5°C (см. таблицу 5.1 СП 131.13330);
б) на участки покрытий длиной b, b и b, у перепадов высот зданий и парапетов (см. схемы Б.8-Б.11 приложения Б).
10.10 Термический коэффициент c следует применять для учета снижения снеговых нагрузок на покрытия с высоким коэффициентом теплопередачи (>1 Вт/(м°С) вследствие таяния, вызванного потерей тепла.
При определении снеговых нагрузок для неутепленных покрытий зданий с повышенными тепловыделениями, приводящими к таянию снега, при уклонах кровли свыше 3% и обеспечении надлежащего отвода талой воды следует вводить термический коэффициент c=0,8. В остальных случаях c=1,0.
Примечание - Значения коэффициента c допускается устанавливать в специальных рекомендациях с учетом термоизоляционных свойств материалов и формы конструктивных элементов.
10.11 Для районов со средней температурой января минус 5°С и ниже (по таблице 5.1 СП 131.13330) пониженное нормативное значение снеговой нагрузки (см. 4.1) определяется умножением ее нормативного значения на коэффициент 0,5. При этом коэффициенты с и с принимаются равными единице.
Для районов со средней температурой января выше минус 5°C пониженное значение снеговой нагрузки не учитывается.
Пониженное нормативное значение следует учитывать при расчете прогибов покрытий или их участков, оборудованных системами снеготаяния, а также в других случаях, установленных в нормах проектирования строительных конструкций.
10.12 Коэффициент надежности по нагрузке для снеговой нагрузки следует принимать равным 1,4.

10.13 Горизонтальные и вертикальные нагрузки от сползания снега, действующие на нижележащие конструкции покрытия, выступающие над кровлей элементы ограждающих конструкций, фасадных систем, инженерное оборудование и снегозадерживающие устройства, устанавливаются в рекомендациях, разрабатываемых в соответствии с заданием на проектирование с учетом 4.7. В необходимых случаях следует учитывать динамическое действие нагрузок от сползания снега.
Приложение Б     
Схемы снеговых нагрузок и коэффициенты формы *
Б.1 Здания с односкатными и двускатными покрытиями
а) Для зданий с односкатными и двускатными покрытиями (рисунок Б.1) коэффициент определяется по таблице Б.1. Промежуточные значения определяются линейной интерполяцией.
Рисунок Б.1
Таблица Б.1
Уклон покрытия , град.	
30° 1
60° 0
б) Варианты 2 и 3 следует учитывать для зданий с двускатными покрытиями (профиль б), при этом вариант 2 - при 15°40°; вариант 3 - при 10°30° только при наличии ходовых мостиков или аэрационных устройств по коньку покрытия.
Примечания
1 Для конструктивных схем покрытий, чувствительных к локальной неравномерности распределения снеговой нагрузки, необходимо рассмотреть дополнительную схему с коэффициентами =0,9 и =1,1 на двух скатах в поперечном направлении (см. вариант 2, рисунок Б.1) или в смежных пролетах покрытия по длине здания.
2 Для покрытий, имеющих габаритные размеры, превышающие 100 м в обоих направлениях, помимо равномерно распределенной снеговой нагрузки необходимо учитывать случай неравномерно распределенной снеговой нагрузки согласно вариантам 2 или 3 для двускатных покрытий или примечанию 1 для односкатных независимо от их уклона.
Б.2 Здания со сводчатыми и близкими к ним по очертанию покрытиями
Здания со сводчатыми и близкими к ним по очертанию покрытиями
Для зданий со сводчатыми и близкими к ним по очертанию покрытиями (см. рисунок Б.2) следует принимать
; ,                                   (Б.1)
где - уклон покрытия, град; при этом значения вычисляются в каждой точке покрытия.
Для сводчатых поверхностей кругового очертания значения вычисляются в точках с уклоном =30°, =60° и в крайнем сечении покрытия (точки A, B и C на рисунке Б.2). Промежуточные значения определяются линейной интерполяцией. Для сводчатых покрытий некругового очертания значения вычисляются по формуле (Б.1) в каждой точке. При 60° =0 и =0.
Рисунок Б.2     
Покрытия в виде стрельчатых арок
Для покрытий в виде стрельчатых арок (рисунок Б.3) при 15° необходимо использовать схему Б.1 - рисунок Б.1, б, принимая , при <15° схему Б.2 - рисунок Б.2.
Рисунок Б.3
Подраздел Б.2
Б.3 Здания с продольными фонарями     
Здания с продольными фонарями, закрытыми сверху
Для зданий с продольными фонарями (независимо от их расположения на покрытии), закрытыми сверху (рисунок Б.4), для двух схем снеговой нагрузки (рисунок Б.5) коэффициенты следует определять как:
=0,8; ; ,                                (Б.2)     
но не более 4,0 и не более 2; , но не более .
При определении нагрузки у торца фонаря для зоны В значение коэффициента в обоих вариантах следует принимать равным 1,0. 
Рисунок Б.4
Рисунок Б.5
Примечания
1 Схемы вариантов 1, 2 (рисунок Б.5) следует также применять для двускатных и сводчатых покрытий двух- или многопролетных зданий с фонарями в середине зданий.
2 Влияние ветроотбойных щитов на распределение снеговой нагрузки возле фонарей не учитывать.
3 Для плоских скатов при b>24 м следует учитывать местную повышенную нагрузку у фонаря, как у перепадов (см. рисунки Б.11, а, б).
Здания с продольными фонарями, открытыми сверху
Для зданий с продольными фонарями, открытыми сверху (рисунок Б.6):;                                             (Б.3).                                           (Б.4)
Значения b (b, b) и m следует определять в соответствии с указаниями к схеме Б.8; пролет принимается равным расстоянию между верхними кромками фонарей.
Рисунок Б.6
Здания с зенитными фонарями
Для зданий с зенитными фонарями, имеющими диагональ не более 15 м, следует применять схемы по Б.11, имеющими диагональ более 15 м - наиболее неблагоприятные схемы снеговых нагрузок по Б.3 и Б.8.
Подраздел Б.3 
     Б.4 Шедовые покрытия
Схемы рисунка Б.7 следует применять для шедовых покрытий, в том числе с наклонным остеклением и сводчатым очертанием кровли.
Рисунок Б.7
Б.5 Двух- и многопролетные здания с двускатными покрытиями Для двух- и многопролетных зданий с двускатными покрытиями (см. рисунок Б.8) вариант 1 следует учитывать во всех случаях, вариант 2 - для двухпролетных зданий при 15°, вариант 3 - для многопролетных зданий при 15°. Для двух- и многопролетных зданий при 30° следует учитывать также схему варианта 2 на рисунке Б.9. Для покрытий, имеющих габаритные размеры, превышающие 100 м в обоих направлениях, при <15° необходимо учитывать случай неравномерно распределенной снеговой нагрузки с коэффициентами =0,9 и =1,1 в смежных пролетах.

Рисунок Б.8*

Б.6 Двух- и многопролетные здания со сводчатыми и близкими к ним по очертанию покрытиями
Для двух- и многопролетных зданий со сводчатыми и близкими к ним по очертанию покрытиями (рисунок Б.9) вариант 2 следует учитывать при >0,1.
Рисунок Б.9
Б.7 Двух- и многопролетные здания с двускатными и сводчатыми покрытиями с продольным фонарем
а) Для пролетов с фонарем двух- и многопролетных зданий с двускатными и сводчатыми покрытиями (рисунок Б.10) коэффициент следует принимать в соответствии с вариантами 1 и 2 (рисунок Б.5), для пролетов без фонаря - с вариантами 1 и 2 (рисунки Б.8, Б.9).
б) Для плоских двускатных (<15°) и сводчатых <0,1 покрытий при >48 м следует учитывать местную повышенную нагрузку, как у перепадов высоты (рисунок Б.11, а).
Рисунок Б.10
Б.8 Здания с перепадом высоты
а) Для зданий с перепадом высоты снеговую нагрузку на верхнее покрытие следует принимать в соответствии со схемами Б.1-Б.7, а на нижнее - в двух вариантах: по схемам Б.1-Б.7 и схеме Б.8 (для зданий - профили а, б (рисунки Б.11, а, Б.11, б), для навесов - профиль в (рисунок Б.11, в).

Рисунок Б.11          

б) Коэффициент следует принимать равным                                         (Б.5)

где h - высота перепада, м, отсчитываемая от верхней точки конструкций более высокой части здания у перепада высот до кровли нижнего покрытия;
; - длины участков верхнего () и нижнего () покрытия, с которых переносится снег в зону перепада высоты, м, их следует принимать:
для покрытия без продольных фонарей или с поперечными фонарями   ;
для покрытия с продольными фонарями или ступенчатыми перепадами высот   .
При этом и следует принимать не менее 0;
m; m - доли снега, переносимого ветром к перепаду высоты; их значения для верхнего m и нижнего m покрытий следует принимать в зависимости от их профиля:
0,4 - для плоского покрытия с 20°, сводчатого с 1/8;
0,3 - для плоского покрытия с >20°, сводчатого с >1/8 и покрытий с поперечными фонарями.
Длину участка переноса по нижнему покрытию, не имеющему парапетов, следует принимать не более утроенной его ширины.

в) Для пониженных покрытий шириной <21 м (см. рисунок Б.11, б) значение m следует принимать:

, но не менее 0,1, где , (при обратном уклоне, показанном на чертеже пунктиром, =1); , но не менее 0,3 ( - в м; , - в град.).

г) Длину зоны повышенных снегоотложений b следует принимать равной:
при , но не более 16 м;
при
,                                                  (Б.6)
но не более 5h и не более 16 м, где принимается из пункта б).
д) Коэффициенты , принимаемые для расчетов (показанные на схемах для трех вариантов), не должны превышать:
(где h - в м; S - в кПа);
4 - если нижнее покрытие является покрытием здания, а и 48 м;
6 - если нижнее покрытие является навесом или покрытием здания и или >72 м.
Промежуточные значения определяются интерполяцией для наибольшего значения из или .
е) Коэффициент следует принимать:
для покрытий с парапетами и без парапетов при ;
для покрытий без парапетов при ;
при и - для покрытии с парапетами, где принимается из пункта б);
- в остальных случаях, где принимается из пункта д), но не менее 0,2.

ж) При наличии между нижерасположенным покрытием и стенкой перепада высот разрыва шириной не более 1,5 м местную повышенную снеговую нагрузку на покрытие в зоне перепада следует определять так же, как для покрытий без разрыва. При этом для нижерасположенного покрытия принимается только приходящаяся на него часть трапециевидной эпюры коэффициента .
Примечания
1 При d(d)>12 м значение для участка перепада длиной d(d) (рисунок Б.11, а) следует определять без учета влияния фонарей на повышенном (пониженном) покрытии.
2 Если пролеты верхнего (нижнего) покрытия имеют различный профиль, то при определении необходимо принимать соответствующее значение m(m) для каждого пролета в пределах .
3 Местную нагрузку у перепада не следует учитывать, если высота перепада, м, между двумя смежными покрытиями менее (где - в кПа).
4 При наличии возле перепада на верхнем покрытии сплошного парапета высотой h более 0,5, кПа и более 1,2 м допускается принимать m=0.
Подраздел Б.8 (Измененная редакция, Изм. N 1, 2).

Б.9 Здания с двумя перепадами высоты
Для зданий с двумя перепадами высоты снеговую нагрузку на верхние и нижние покрытия следует принимать по схеме, приведенной на рисунке Б.12. Значения , , , следует определять для каждого перепада независимо, принимая: m и m по схеме Б.9 (при определении нагрузок возле перепадов h и h) соответствующими m в схеме Б.8 и m (доля снега, переносимого ветром по пониженному покрытию) соответствующим m в схеме Б.8.
При наложении зон повышенных снегоотложений (см. вариант 2 на рисунке Б.12):
;                                                (Б.7)
;                                  (Б.8)
.                                 (Б.9)
Если и/или , то принимается огибающая полученных эпюр и .
Рисунок Б.12     
Б.10 Висячие покрытия цилиндрической формы
Для висячих покрытий цилиндрической формы (рисунок Б.13) следует принимать:;   .
Рисунок Б.13     
Б.11 Здания с купольными круговыми и близкими к ним по очертанию покрытиями
а) Для зданий с купольными круговыми и близкими к ним по очертанию покрытиями (рисунок Б.14) коэффициент определяется по таблице Б.2. Промежуточные значения определяются линейной интерполяцией. При максимальном уклоне <30° принимается .
Рисунок Б.14     
Таблица Б.2	
Уклон покрытия , град.	
30°	
1
60°	
0
Для пологих куполов с отношением 0,05 следует учитывать только вариант 1.
Для куполов с отношением >0,05 следует учитывать варианты 1, 2 и 3 при уклонах <60°.
Для варианта 2 на рисунке Б.14 следует принимать при,                                            (Б.10)
   где ;
при , при =45°; =0, при >60°.
Промежуточные значения определяются линейной интерполяцией.
Для варианта 3 следует принимать.                                     (Б.11)
Вариант 3 следует учитывать для куполов с >0,05 при сильно шероховатой поверхности покрытия, наличии на нем возвышающихся надстроек, фонарей или снегозадерживающих преград, а также для покрытий, защищенных от ветра соседними более высокими зданиями или объектами окружающей застройки.
б) Для покрытий в виде сочетания двух сферических поверхностей различной кривизны на круглом плане следует учитывать снеговые нагрузки, как показано на рисунке Б.14а.
Для варианта 1 на участке A-B шириной ; на участке B-B шириной . При 7° и следует учитывать только вариант 1.
Для вариантов 2 и 3 коэффициент вычисляется по схеме 2 на рисунке Б.14. При этом принимается, как показано на рисунке Б.14а. Коэффициент вычисляется по схеме 2 на рисунке Б.14 для центральной части покрытия при , а отсчитывается от центра проекции сферы.

При 7°<15° следует учитывать варианты 1 и 2; при 15°<30° следует учитывать варианты 1 и 3. При >30° следует учитывать схемы по перечислению а) Б.11 без учета изменения геометрии поверхности.
Рисунок Б.14а
Подраздел Б.11. (Измененная редакция, Изм. N 2).
Б.12 Здания с коническими круговыми покрытиями и покрытиями в виде сочетания сферической и конической поверхностей*
а) Для зданий с коническими круговыми покрытиями (см. рисунок Б.15) коэффициент определяется по таблице Б.3. Промежуточные значения определяются линейной интерполяцией.
Таблица Б.3
Уклон покрытия , град.	
30°
1

60°
0

Для пологих куполов при 7° следует учитывать только вариант 1.
Для менее пологих куполов при 7°30° для варианта 2 следует принимать                                         (Б.12)
где .
При 30°60° для варианта 2 следует принимать:                                 (Б.13)
где - в градусах.
      Рисунок Б.15
б) Для зданий с круговыми покрытиями в виде сочетания сферической и конической поверхностей (см. рисунок Б.15а) коэффициент определяется по таблице Б.3.
Коэффициент для варианта 2 (см. рисунок Б.15а) определяется следующим образом:
- на участке 1 - по формуле (Б.10) в зависимости от уклона при , принимаемом как радиус круга, расположенный между D и E;
- на участке 2 - 0,5, где вычисляется по формуле (Б.10) при =90°;
- на участках 3 и 4 - по формулам (Б.12) или (Б.13) в зависимости от уклона ;
- на участке 5 - при 7°<15°; 0,5 при 15°<30° и =0 при >30°;
- на участке 6 - 0,5, где вычисляется по формуле (Б.10) в зависимости от уклона .
Для пологих куполов при 10° и 7° следует учитывать только вариант 1.
     Рисунок Б.15а
Для покрытий, рассматриваемых в перечислении б), должно соблюдаться условие .
Подраздел Б.12.
Б.13 Покрытие с парапетами
а) Снеговую нагрузку на покрытие возле парапетов следует принимать по схеме, приведенной на рисунке Б.16.        
Рисунок Б.16
б) Схему на рисунке Б.16 для покрытий с парапетами следует применять при (h - в м; S - в кПа);
, но не более 3.
в) Для плоских (<15°) и сводчатых покрытий при длине зоны переноса снега >24 м, а также при высоте парапета более 1,2 м следует учитывать местную повышенную нагрузку, как у перепадов высоты (см. на рисунке Б.11) в том случае, если эта схема более неблагоприятна, чем на рисунке Б.16.
Пункт Б.13 
Б.14 Участки покрытий, примыкающие к возвышающимся над кровлей вентиляционным шахтам и другим надстройкам
а) Схема на рисунке Б.17 относится к участкам с надстройками с диагональю основания не более 15 м.
б) В зависимости от рассчитываемой конструкции (плит покрытия, подстропильных и стропильных конструкций) необходимо учитывать самое неблагоприятное положение зоны повышенной нагрузки (при произвольном угле ).
в) Коэффициент для участков покрытий, примыкающих к возвышающимся над кровлей вентиляционным, лестничным шахтам, зенитным фонарям и другим надстройкам (рисунок Б.14), постоянный в пределах указанной зоны, следует принимать равным:
1,0 при d1,5 м;
при d>1,5 м,     
но не менее 1,0 и не более:     
1,5 при 1,55 м;
2,0 при 510 м;
2,5 при 1015 м;     
, но не более 2d.
Наличие зенитных фонарей и надстроек с диагональю не более 5 м, возвышающихся над кровлей не более чем на 0,4 м, допускается не учитывать."
